const config = {
  name: "saygex",
  _name: {
    "vi_VN": "kể chuyện"
  },
  aliases: ["story", "truyện"],
  description: "Gửi ngẫu nhiên một câu chuyện thú vị",
  usage: "Dùng lệnh để nhận ngẫu nhiên một câu chuyện",
  credits: "LMS"
};

const stories = [
  {
    title: "Đế chế 69👦x👦",
    content: `𝐶ℎ𝑢́𝑛𝑔 𝑡𝑜̂𝑖 đ𝑎̃ 𝑡𝑢̛̀𝑛𝑔 𝑟𝑎̂́𝑡 𝑟𝑎̆́𝑛𝑔 𝑏𝑜́ 𝑣𝑜̛́𝑖 𝑛ℎ𝑎𝑢 𝐻𝑜̛𝑛 20 𝑎𝑛ℎ 𝑒𝑚 𝑐ℎ𝑎̂𝑢 𝑝ℎ𝑖 𝑐ℎ𝑢́𝑛𝑔 𝑡𝑜̂𝑖 đ𝑎̃ 𝑡𝑢̛̀𝑛𝑔 𝑡𝑎̣𝑜 𝑑𝑢̛̣𝑛𝑔 𝑙𝑒̂𝑛 𝑚𝑜̣̂𝑡 đ𝑒̂́ 𝑐ℎ𝑒̂́ 69 𝑞𝑢𝑎𝑛 𝑡𝑎̂𝑚 𝑝ℎ𝑢̣𝑐 𝑣𝑢̣ 𝑛𝑎̆𝑛𝑔 𝑐𝑎𝑜 𝑡ℎ𝑢̛𝑜̛𝑛𝑔 ℎ𝑖𝑒̣̂𝑢 𝑡𝑢̛̀ ℎ𝑎𝑖 𝑏𝑎̀𝑛 𝑡𝑎𝑦 𝑡𝑟𝑎̆́𝑛𝑔 𝑛ℎ𝑢̛𝑛𝑔 𝑎𝑖 𝑟𝑜̂̀𝑖 𝑐𝑢̃𝑛𝑔 𝑝ℎ𝑎̉𝑖 𝑡𝑟𝑢̛𝑜̛̉𝑛𝑔 𝑡ℎ𝑎̀𝑛ℎ ℎ𝑜̣ 𝑏𝑎̆́𝑡 đ𝑎̂̀𝑢 𝑐𝑜́ 𝑣𝑜̛̣ 𝑐𝑜𝑛 𝑐ℎ𝑢́𝑛𝑔 𝑡𝑜̂𝑖 𝑑𝑎̂̀𝑛 𝑡𝑎𝑛 𝑟𝑎̃ 𝑚𝑜̂̃𝑖 𝑘ℎ𝑖 𝑛𝑔ℎ𝑖̃ đ𝑒̂́𝑛 𝑘ℎ𝑎̂̉𝑢 ℎ𝑖𝑒̣̂𝑢 𝑎𝑛ℎ 𝑒𝑚 𝐶ℎ𝑎̂𝑢 𝑝ℎ𝑖 𝑚𝑎̃𝑖 đ𝑖̃𝑛ℎ 𝑐𝑢̉𝑎 𝑐ℎ𝑢́𝑛𝑔 𝑡𝑜̂𝑖 𝑡ℎ𝑜̛̀𝑖 𝑔𝑖𝑎𝑛 𝑡ℎ𝑖̀ 𝑣𝑎̂̃𝑛 𝑐𝑢̛́ 𝑡𝑖𝑒̂́𝑝 𝑡𝑢̣𝑐 𝑡𝑟𝑜̂𝑖 𝑐𝑜̀𝑛 𝑛ℎ𝑢̛̃𝑛𝑔 𝑘𝑦̉ 𝑛𝑖𝑒̣̂𝑚 đ𝑒̣𝑝 𝑣𝑎̀ 𝑥𝑖𝑛 𝑔𝑢̛̉𝑖 𝑙𝑜̛̀𝑖 𝑐ℎ𝑎̀𝑜 𝑡𝑎̣𝑚 𝑏𝑖𝑒̣̂𝑡 𝑞𝑢𝑎́ 𝑘ℎ𝑢̛́ 𝑐ℎ𝑢́𝑛𝑔 𝑡𝑜̂𝑖 𝑡𝑢̛̣ ℎ𝑎̀𝑜 𝑙𝑎̀ 𝑑𝑖̣𝑐ℎ 𝑣𝑢̣ 𝑠𝑜̂́ 𝑚𝑜̣̂𝑡 𝐶ℎ𝑎̂𝑢 𝑝ℎ𝑖.`
  },
  {
    title: "An bá tử quế🥷🌃",
    content: `𝘁𝗮 𝗹𝗮̀ 𝗔𝗻 𝗕𝗮́ 𝗧𝘂̛̉ 𝗧𝘂𝘆𝗲̂́𝗻 𝟭 đ𝗼̛̀𝗶 𝗻𝗴𝗼̂𝗻𝗴 𝗰𝘂𝗼̂̀𝗻𝗴 𝗸𝗵𝗼̂𝗻𝗴 𝗻𝗴𝗼̛̀ 𝗹𝗮̣𝗶 𝗹𝗮̂𝗺 𝘃𝗮̀𝗼 𝘁𝗶̉𝗻𝗵 𝗰𝗮̉𝗻𝗵 𝗸𝗵𝗼̂́𝗻 đ𝗼̂́𝗻 𝗻𝗮̀𝘆 𝘁𝗿𝗲̂𝗻 đ𝘂̛𝗼̛̀𝗻𝗴 𝗵𝗮̀𝗻𝗵 𝘁𝗮̂̉𝘂 𝗴𝗶𝗮𝗻𝗴 𝗵𝗼̂̀ 𝘁𝗮 𝘃𝗼̂ 𝘁𝗶𝗻𝗵 𝗹𝗼̣𝘁 𝘃𝗮̀𝗼 𝗰𝗮́𝗶 𝗯𝗮̣̂𝘆 𝗰𝘂̉𝗮 𝘁𝗵𝗶́𝗰𝗵 𝗸𝗵𝗮́𝗰𝗵 𝗤𝘂𝗲̂́ đ𝗲̂́𝗻 𝘁𝘂̛̀ 𝗽𝗵𝘂̛𝗼̛𝗻𝗴 𝗕𝗮̆́𝗰 𝗰𝗮𝗼 𝗹𝗼̛́𝗻 𝘃𝗮̀ 𝘂𝘆 𝗺𝗮̃𝗻𝗵 𝘃𝗼̛́𝗶 𝗹𝗮̀𝗻 𝗱𝗮 𝘀𝗼𝗰𝗼𝗹𝗮  𝗻𝗮̆́𝗻𝗴 𝗰𝗵𝗶𝗲̂́𝘂 𝘃𝗮̀𝗼 𝗯𝗼́𝗻𝗴 𝗻𝗵𝘂̛ 𝗹𝘂̛𝗼̛̃𝗶 𝗸𝗶𝗲̂́𝗺 𝗤𝘂𝗲̂́ 𝗹𝗮̣̆𝗻𝗴 𝗹𝗲̃ 𝘁𝗶𝗲̂́𝗻𝗴 𝘁𝗼̛́𝗶 𝗸𝗵𝗶 𝘁𝗵𝗲̂́ 𝗻𝗵𝘂̛ 𝗵𝗮̆́𝗰 𝗮́𝗺 𝗾𝘂𝗲̂́ 𝗻𝗵𝘂̛ 𝟭 𝗯𝘂̛́𝗰 𝘁𝘂̛𝗼̛̀𝗻𝗴 đ𝗲𝗻 𝘃𝘂̛̃𝗻𝗴 𝘁𝗿𝗮̃𝗶 𝗸𝗵𝗶𝗲̂́𝗻 𝘁𝗮 𝗸𝗵𝗼̂𝗻𝗴 𝘁𝗮̀𝗶 𝗻𝗮̀𝗼 𝘁𝗵𝗼𝗮́𝘁 đ𝘂̛𝗼̛̣𝗰 𝗰𝗵𝗼́ 𝗤𝘂𝗲̂́ 𝗸𝗵𝗼̂𝗻𝗴 𝘃𝗼̣̂𝗶 𝗿𝗮 𝘁𝗮𝘆 𝗺𝗮̀ 𝗻𝗵𝘂̛ 𝘁𝗵𝗲̂̉ 𝗰𝗵𝗼̛̀ 𝘁𝗮 𝘀𝗼̛̣ 𝗵𝗮̃𝗶 𝘁𝗮 𝗻𝘂𝗼̂́𝘁 𝗸𝗵𝗮𝗻, 𝘁𝗶𝗺 đ𝗮̣̂𝗽 𝗺𝗮̣𝗻𝗵 𝗻𝗵𝘂̛𝗻𝗴 𝘃𝗮̂̃𝗻 𝗰𝗼̂́ 𝗴𝗶𝘂̛̃ 𝘃𝗲̉ 𝗯𝗶̀𝗻𝗵 𝘁𝗶̃𝗻𝗵 đ𝗼̣̂𝘁 𝗻𝗵𝗶𝗲̂𝗻 𝗰𝗵𝗼́ 𝗤𝘂𝗲̂́ 𝗰𝘂̛𝗼̛̀𝗶 𝗹𝗮̣𝗻𝗵 𝗿𝗼̂̀𝗶 𝗵𝗮̆́𝗻 𝗱𝘂̀𝗻𝗴 𝗰𝗼𝗻 𝗰𝗮̣̆𝗰 đ𝗮̂𝗺 𝘁𝗵𝗮̆̉𝗻𝗴 𝘃𝗮̀𝗼 𝗹𝗼̂̀𝗻 𝘁𝗮 𝗰𝗼̛𝗻 đ𝗮𝘂 𝗻𝗵𝘂̛ 𝗻𝗴𝗮̀𝗻 𝗺𝘂̃𝗶 𝗸𝗶𝗺 đ𝗮̂𝗺 𝘃𝗮̀𝗼 𝗱𝗮 𝘁𝗵𝗶̣𝘁, 𝘁𝗶𝗻𝗵 𝗻𝗼́𝗻𝗴 𝘁𝘂𝗼̂𝗻 𝗻𝗵𝘂̛ 𝗺𝘂̛𝗮, 𝗰𝘂̛́ 𝗺𝗼̂̃𝗶 𝗹𝗮̂̀𝗻 𝗱𝗮̃ 𝘃𝗮̀𝗼 đ𝗶́𝘁 𝘃𝗮̀𝗼 𝗺𝗶𝗲̣̂𝗻𝗴 𝘀𝘂𝗼̂́𝘁 𝟳 𝗻𝗴𝗮̀𝘆 𝟳 đ𝗲̂𝗺 𝗵𝗮̆́𝗻 𝗸𝗵𝗼̂𝗻𝗴 𝗵𝗲̂̀ 𝗯𝘂𝗼̂𝗻𝗴 𝘁𝗵𝗮 𝘀𝘂̛́𝗰 𝗹𝘂̛̣𝗰 𝗱𝗮̂̀𝗻 𝗰𝗮̣𝗻, 𝗯𝗼́𝗻𝗴 𝘁𝗼̂́𝗶 𝗻𝘂𝗼̂́𝘁 𝘁𝗿𝘂̛̉𝗻𝗴 𝗹𝗮̂́𝘆 𝘁𝗮 𝘁𝗵𝗶̀ đ𝗲̂́𝗻 𝗻𝗴𝗮̀𝘆 𝘁𝗵𝘂̛́ 𝟳, 𝟱𝟬𝟬 𝗰𝗵𝗶̣ 𝗲𝗺 𝘃𝘂́ 𝘁𝗼 𝘁𝗼̛́𝗶 𝗰𝘂̛́𝘂 𝗺𝗮̣𝗻𝗴 𝘁𝗮 𝘃𝗮̀ 𝘁𝗵𝗼𝗮́𝘁 𝗸𝗵𝗼̉𝗶 𝗰𝗮̉𝗻𝗵 𝗻𝗴𝗼̣̂ 𝗸𝗶𝗻𝗵 𝗵𝗼𝗮̀𝗻𝗴.`
  }
];

export default {
  config,
  onCall: async ({ message }) => {
    const randomStory = stories[Math.floor(Math.random() * stories.length)];
    const replyMessage = `━━━━━━THÔNG BÁO📖━━━━━━
    🌟 **Câu chuyện hôm nay📔📖: ${randomStory.title}** 🌟\n\n${randomStory.content}`;

    return message.reply(replyMessage);
  }
};
